In [40]:
!pip install pandas numpy

Requirement already satisfied: pandas in c:\users\jean\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: numpy in c:\users\jean\anaconda3\lib\site-packages (1.25.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\jean\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jean\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\jean\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [41]:
import pandas as pd
doc1 = pd.read_csv('data/daily_sales_data_0.csv')
doc2 = pd.read_csv('data/daily_sales_data_1.csv')
doc3 = pd.read_csv('data/daily_sales_data_2.csv')

In [42]:
doc1 = doc1[doc1['product'] == 'pink morsel']
doc2 = doc2[doc2['product'] == 'pink morsel']
doc3 = doc3[doc3['product'] == 'pink morsel']

In [43]:
doc1

           product  price  quantity        date region
0      pink morsel  $3.00       546  2018-02-06  north
1      pink morsel  $3.00       549  2018-02-06  south
2      pink morsel  $3.00       577  2018-02-06   east
3      pink morsel  $3.00       519  2018-02-06   west
28     pink morsel  $3.00       529  2018-02-07  north
...            ...    ...       ...         ...    ...
13667  pink morsel  $3.00       599  2019-06-09   west
13692  pink morsel  $3.00       566  2019-06-10  north
13693  pink morsel  $3.00       563  2019-06-10  south
13694  pink morsel  $3.00       541  2019-06-10   east
13695  pink morsel  $3.00       589  2019-06-10   west

[1960 rows x 5 columns]

In [44]:
doc1['price'] = doc1['price'].str.replace('$', '').astype(float)
doc2['price'] = doc2['price'].str.replace('$', '').astype(float)
doc3['price'] = doc3['price'].str.replace('$', '').astype(float)

C:\Users\jean\AppData\Local\Temp\ipykernel_19268\1447542012.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  doc1['price'] = doc1['price'].str.replace('$', '').astype(float)
C:\Users\jean\AppData\Local\Temp\ipykernel_19268\1447542012.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  doc2['price'] = doc2['price'].str.replace('$', '').astype(float)
C:\Users\jean\AppData\Local\Temp\ipykernel_19268\1447542012.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  doc3['price'] = doc3['price'].str.replace('$', '').astype(float)

In [45]:
doc1['sales'] = doc1['quantity'] * doc1['price']
doc2['sales'] = doc2['quantity'] * doc2['price']
doc3['sales'] = doc3['quantity'] * doc3['price']

In [46]:
doc1 = doc1[['sales', 'date', 'region']]
doc2 = doc2[['sales', 'date', 'region']]
doc3 = doc3[['sales', 'date', 'region']]

sales_total= pd.concat([doc1, doc2, doc3], ignore_index=True)
sales_total.to_csv('sales_total.csv', index=False)

In [47]:
sales_total

       sales        date region
0     1638.0  2018-02-06  north
1     1647.0  2018-02-06  south
2     1731.0  2018-02-06   east
3     1557.0  2018-02-06   west
4     1587.0  2018-02-07  north
...      ...         ...    ...
5875  2390.0  2022-02-13   west
5876  2035.0  2022-02-14  north
5877  2465.0  2022-02-14  south
5878  2500.0  2022-02-14   east
5879  2115.0  2022-02-14   west

[5880 rows x 3 columns]